test/artillery-login.yml
config:
  target: 'http://localhost:4000'
  http:
    timeout: 1
  phases:
    -
      duration: 10
      arrivalRate: 50
      name: "Warm-up"
    - duration: 10
      arrivalRate: 50
      name: "Running"

  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'

scenarios:
  - flow:
    - post:
        url: "/login"
        json:
          email: "evaleto@gmail.com"
          password: "testing"
          provider: "local"          
        cookie:
          saved: "artillery-cookies"
    - get:
        url: "/v1/products?available=true&discount=true&home=true&maxcat=8&popular=true&status=true&when=true"
#        cookie:
#          saved: "artillery-cookies"
#    - get:
#        url: "/v1/documents"
#        cookie:
#          saved: "artillery-cookies"
#    - get:
#        url: "/v1/config?lang=fr"
#        cookie:
#          saved: "artillery-cookies"
#    - get:
#        url: "/v1/users/me"
#        cookie:
#          saved: "artillery-cookies"